Tekla Open API Reference for Tekla Structures 2025
MeshItemEnumerator Methods
The MeshItemEnumerator type exposes the following members.
Methods
Name | Description
GetSize
 Returns the total amout of items.
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
SelectMeshItem
 Selects a mesh item in the mesh database with the given name and grade.
Top
See Also
Reference
MeshItemEnumerator Class
Tekla.Structures.Catalogs Namespace